{"Resource": [{
    "id": 1,
    "url": "https://content.jwplatform.com/manifests/yp34SRmf.m3u8",
    "title": "Apple",
    "thumbnail": "Sample1",
    "description" : "Big Buck Bunny tells the story of a giant rabbit with a heart bigger than himself. When one sunny day three rodents rudely harass him, something snaps... and the rabbit ain't no bunny anymore! In the typical cartoon tradition he prepares the nasty rodents a comical revenge."
},{
    "id": 2,
    "url": "https://bitdash-a.akamaihd.net/content/sintel/hls/playlist.m3u8",
    "title": "Elephant Dream",
    "thumbnail": "Sample2",
    "description" : "A good set of test cases accessible by other team members makes it easier for others to learn about the product as well. Think of customer support, for example. The support team can browse test cases to understand how upcoming features are going to work. They can use those test cases to write technical documentation and help content"

},{
    "id": 3,
    "url": "https://mnmedias.api.telequebec.tv/m3u8/29880.m3u8",
    "title": "For Bigger Blazes",
    "thumbnail": "Sample3",
    "description" : "Writing test cases puts you in your user’s shoes, which builds empathy for the individuals who will actually be using your product. This empathy can easily trickle back into the design and development process, and have a broad impact. As you write test cases, you’ll identify gaps and areas for improvement, things that don’t quite make sense, and these things can be addressed before the application is released into production"

},{
    "id": 4,
    "url": "https://bitdash-a.akamaihd.net/content/MI201109210084_1/m3u8s/f08e80da-bf1d-4e3d-8899-f0f6155f6efa.m3u8",
    "title": "By Google",
    "thumbnail": "Sample4",
    "description" : "There’s no right or wrong place to document your test cases, but there are many tools that help make the process of writing test cases more effective and efficient. For example, test cases have traditionally been written in a spreadsheet. Many testing teams still opt for this approach. It’s fairly flexible, you can create your own process and method of tracking test cases, but it can also be extremely time consuming, and clunky"
},{
    "id": 5,
    "url": "https://commondatastorage.googleapis.com/gtv-videos-bucket/sample/BigBuckBunny.mp4",
    "title": "By Blender Foundation",
    "thumbnail": "Sample5",
    "description" : "With a tool dedicated to test cases, you can write your test cases, perform your tests, report on the results, and collaborate with your team throughout every step of the process. This is where TestLodge really shines"

},{
    "id": 6,
    "url": "https://content.jwplatform.com/manifests/yp34SRmf.m3u8",
    "title": "Radhachandan",
    "thumbnail": "Sample6",
    "description" : "A good test case is reusable and provides long-term value to the software testing team.  When writing a test case, keep this in mind. You can save time down the road by re-using the test case instead of re-writing it."

},{
    "id": 7,
    "url": "http://techslides.com/demos/sample-videos/small.mp4",
    "title": "Android",
    "thumbnail": "Sample7",
    "description" : "The expected result tells the tester what they should experience as a result of the test steps. This is how the tester determines if the test case is a “pass” or “fail”"

},{
    "id": 8,
    "url": "http://techslides.com/demos/sample-videos/small.3gp",
    "title": "React Native",
    "thumbnail": "Sample8",
    "description" : "Test cases should be simple. Keep in mind, the person who wrote the test case might not be the same person who executes the the test itself. The test steps should include the necessary data and information on how to execute the test.  This is perhaps the most important part of a test case. Keep this section clear and concise, but don’t leave out any necessary details. Write the test case so that anyone can go in and perform the test"

},{
    "id": 9,
    "url": "https://www.radiantmediaplayer.com/media/bbb-360p.mp4",
    "title": "Java Script",
    "thumbnail": "Sample9",
    "description" : "You should include any assumptions that apply to the test and any preconditions that must be met prior to the test being executed.  This information can include which page the user should start the test on, dependencies on the test environment, and any special setup requirements that must be done before running the test.  This information also helps keep the test steps short and concise"

},{
    "id": 10,
    "url": "https://bitdash-a.akamaihd.net/content/sintel/hls/playlist.m3u8",
    "title": "Angular.Js",
    "thumbnail": "Sample10",
    "description" : "The description should tell the tester what they’re going to test. Sometimes this section might also include other pertinent information such as the test environment, test data, and preconditions/assumptions. A description should be easy to read and immediately communicate the high-level goal of the test"
}
]}
